; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image5 - mode
	spectrograph6 - mode
	infrared2 - mode
	infrared0 - mode
	thermograph4 - mode
	spectrograph1 - mode
	image3 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation7 - direction
	Star8 - direction
	Star12 - direction
	Star13 - direction
	Star9 - direction
	GroundStation10 - direction
	Star6 - direction
	Star11 - direction
	Star14 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 image3)
	(supports instrument0 spectrograph6)
	(supports instrument0 infrared0)
	(supports instrument0 infrared2)
	(supports instrument0 image5)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 Star9)
	(supports instrument1 thermograph4)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
)
(:goal (and
	(pointing satellite0 GroundStation10)
	(have_image Star14 spectrograph1)
	(have_image Star14 thermograph4)
	(have_image Planet15 infrared0)
	(have_image Star16 infrared0)
	(have_image Star16 infrared2)
	(have_image Phenomenon17 spectrograph1)
	(have_image Phenomenon17 image5)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
2. (turn_to satellite0 groundstation10 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 groundstation10)
   goals met: 1 of 8
3. (turn_to satellite0 star6 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 star6)
   goals met: 0 of 8
4. (calibrate satellite0 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 0 of 8
5. (turn_to satellite0 groundstation10 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation10)
   goals met: 1 of 8
6. (turn_to satellite0 phenomenon17 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 phenomenon17)
   goals met: 0 of 8
7. (take_image satellite0 phenomenon17 instrument1 spectrograph1)
   added: (have_image phenomenon17 spectrograph1)
   goals met: 1 of 8
8. (turn_to satellite0 star14 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 star14)
   goals met: 1 of 8
9. (take_image satellite0 star14 instrument1 spectrograph1)
   added: (have_image star14 spectrograph1)
   goals met: 2 of 8
10. (take_image satellite0 star14 instrument1 thermograph4)
   added: (have_image star14 thermograph4)
   goals met: 3 of 8
11. (turn_to satellite0 groundstation10 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation10)
   goals met: 4 of 8
12. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 8
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 8
14. (calibrate satellite0 instrument0 groundstation10)
   added: (calibrated instrument0)
   goals met: 4 of 8
15. (turn_to satellite0 phenomenon17 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 phenomenon17)
   goals met: 3 of 8
16. (take_image satellite0 phenomenon17 instrument0 image5)
   added: (have_image phenomenon17 image5)
   goals met: 4 of 8
17. (turn_to satellite0 groundstation10 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 groundstation10)
   goals met: 5 of 8
18. (turn_to satellite0 planet15 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 planet15)
   goals met: 4 of 8
19. (take_image satellite0 planet15 instrument0 infrared0)
   added: (have_image planet15 infrared0)
   goals met: 5 of 8
20. (turn_to satellite0 groundstation10 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 groundstation10)
   goals met: 6 of 8
21. (turn_to satellite0 star16 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 star16)
   goals met: 5 of 8
22. (take_image satellite0 star16 instrument0 infrared0)
   added: (have_image star16 infrared0)
   goals met: 6 of 8
23. (take_image satellite0 star16 instrument0 infrared2)
   added: (have_image star16 infrared2)
   goals met: 7 of 8
24. (turn_to satellite0 groundstation10 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 groundstation10)
   goals met: 8 of 8
